app/controllers/movies_controller.rb

  def index
    sort = params[:sort] || session[:sort]
    case sort
    when 'title'
      ordering,@title_header = {:order => :title}, 'hilite'
    when 'release_date'
      ordering,@date_header = {:order => :release_date}, 'hilite'

    when 'director_name'
      ordering, @director_name_header = {:order => :director_name}, 'hilite'
    end
    @all_ratings = Movie.all_ratings
    @selected_ratings = params[:ratings] || session[:ratings] || {}

    if @selected_ratings == {}
      @selected_ratings = Hash[@all_ratings.map {|rating| [rating, rating]}]
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'NC-17', 'PG', 'PG-13', 'R') ORDER BY director_name

  def create
    @movie = Movie.create!(params[:movie])
---
INSERT INTO "movies" ("created_at", "description", "director_name", "rating", "release_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "release_date" = '2011-03-30 00:00:00.000000', "updated_at" = '2016-03-30 18:19:06.720242' WHERE "movies"."id" = 22

  def moviesWithSameDirector

    sort = params[:sort] || session[:sort]
    case sort
      when 'title'
        ordering,@title_header = {:order => :title}, 'hilite'
      when 'release_date'
        ordering,@date_header = {:order => :release_date}, 'hilite'

      when 'director_name'
        ordering, @director_name_header = {:order => :director_name}, 'hilite'
    end
    @all_ratings = Movie.where(director_name:params[:find_director]).all_ratings
---
SELECT "movies".* FROM "movies" WHERE "movies"."director_name" = 'George Lucas' AND "movies"."rating" IN ('G', 'NC-17', 'PG', 'PG-13', 'R') ORDER BY release_date